kiffie/edc2svd/ci/regtest/PIC32MX170F256B.svd
        <register>
          <name>CNCONASET</name>
          <description>CNCONASET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONAINV</name>
          <description>CNCONAINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENA</name>
          <description>CNENA register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENACLR</name>
          <description>CNENACLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENASET</name>
          <description>CNENASET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENAINV</name>
          <description>CNENAINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATA</name>
          <description>CNSTATA register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATACLR</name>
          <description>CNSTATACLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATASET</name>
          <description>CNSTATASET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATAINV</name>
          <description>CNSTATAINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
